/*
   Localizable.strings - Português Brasileiro
   modizer

   Organizado por telas e famílias de recursos
*/

// ================================
// MARK: - COMMON / GENERAL
// ================================

/* Common Actions */
"Yes" = "Sim";
"No" = "Não";
"Ok" = "Ok";
"Cancel" = "Cancelar";
"Close" = "Fechar";
"Save" = "Salvar";
"Delete" = "Excluir";
"Rename" = "Renomear";
"Extract" = "Extrair";
"Cut" = "Recortar";
"Paste" = "Colar";
"Create" = "Criar";
"Reset" = "Redefinir";

/* Common States */
"Loading" = "Carregando";
"Extracting" = "Extraindo";
"Seeking" = "Buscando";
"Seeking %d%%" = "Buscando %d%%";
"Refreshing" = "Atualizando";
"Browsing" = "Navegando";
"Cancelling..." = "Cancelando...";

/* Common Messages */
"Error" = "Erro";
"OK" = "OK";
"Warning" = "Aviso";
"Do you want to reset to default value:\n" = "Deseja redefinir para o valor padrão:\n";


// ================================
// MARK: - BROWSER
// ================================

/* Browser Main Keys */
"Browser_LocalBrowsing_MainKey" = "Navegação local";
"Browser_LocalBrowsing_SubKey" = "Navegue, reproduza e exclua arquivos locais.";

"Browser_MODLAND_MainKey" = "Coleção MODLAND";
"Browser_MODLAND_SubKey" = "%d arquivos disponíveis.";

"Browser_HVSC_MainKey" = "Coleção HVSC";
"Browser_HVSC_SubKey" = "%d arquivos disponíveis.";

"Browser_Playlists_MainKey" = "Playlists";
"Browser_Playlists_SubKey" = "Organize, crie, exclua e ouça.";

"Browser_Favorites_MainKey" = "Favoritos";
"Browser_Favorites_SubKey" = "Ouça músicas avaliadas.";

"Browser_Most_played_MainKey" = "Mais tocadas";
"Browser_Most_played_SubKey" = "Ouça músicas mais tocadas.";

"Browser_Web_MainKey" = "Web";
"Browser_Web_SubKey" = "Navegue na Internet e baixe músicas.";

"Browser_WorldCharts_MainKey" = "Paradas Mundiais";
"Browser_WorldCharts_SubKey" = "Listas de melhores e links de download.";

"Browser_WebVGM_MainKey" = "VGMRips";
"Browser_WebVGM_SubKey" = "Músicas de videogames";

"Browser_UserGuide_MainKey" = "Guia do Usuário";
"Browser_UserGuide_SubKey" = "Manual, FAQ, dicas.";

/* Browser Display Modes */
"GetAllEntries_MainKey" = "Obter todas as entradas ausentes";
"GetAllEntries_SubKey" = "Limitado às primeiras 256 entradas ausentes.";

"DisplayAll_MainKey" = "Listar tudo ordenado por nome";
"DisplayAll_SubKey" = "Diretório atual:";

"DisplayDir_MainKey" = "Lista/Diretório";
"DisplayDir_SubKey" = "Tudo ordenado por caminho:";

"DisplayAllPath_MainKey" = "Listar tudo ordenado por caminho";
"DisplayAllPath_SubKey" = "Tudo ordenado por nome:";

/* Browser View Modes */
"Formats/Artists/Files" = "Formatos/Artistas/Arquivos";
"Artists/Formats/Files" = "Artistas/Formatos/Arquivos";
"Artists/Files" = "Artistas/Arquivos";
"Formats: %d entries." = "Formatos: %d entradas.";
"Artists: %d entries." = "Artistas: %d entradas.";

/* Browser Stats */
"Played %d times." = "Tocada %d vezes.";
"Played once." = "Tocada uma vez.";
"Never played." = "Nunca tocada.";
"%d files." = "%d arquivos.";
"1 file." = "1 arquivo.";
"Size: %dKB" = "Tamanho: %dKB";

/* Browser Messages */
"Browser not enough mem." = "Entradas demais, não foi possível alocar memória.";
"Browser not enough mem. Limited." = "Entradas demais, não foi possível alocar memória. Lista incompleta.";

/* File Operations */
"New folder" = "Nova pasta";
"Enter folder name" = "Digite o nome da pasta";
"Nothing to paste" = "Nada para colar";
"No file to extract or not supported archive format.\n" = "Nenhum arquivo para extrair ou formato de arquivo não suportado.\n";
"Cannot use iCloud as folder name" = "Não é possível usar iCloud como nome de pasta";

"Issue %d while trying to delete entry.\n%@" = "Problema %d ao tentar excluir entrada.\n%@";
"Issue %d while trying to renamefile.\n%@" = "Problema %d ao tentar renomear arquivo.\n%@";
"Issue %d while moving: %@.\n%@" = "Problema %d ao mover: %@.\n%@";
"Issue %d while creating folder\n%@" = "Problema %d ao criar pasta\n%@";

"File is not available locally.\nTrigerring download from iCloud, please check in 'Files' application." = "Arquivo não disponível localmente.\nIniciando download do iCloud, verifique no aplicativo 'Arquivos'.";

"unavailable" = "indisponível";

// ================================
// MARK: - SEARCH
// ================================

/* Search States */
"Playlist (%d)" = "Playlist (%d)";
"Playlist/Search off" = "Playlist/Busca desativada";

"Local (%d, limited to %d)" = "Local (%d, limitado a %d)";
"Local (%d)" = "Local (%d)";
"Local/Search off" = "Local/Busca desativada";

"Modland (%d, limited to %d)" = "Modland (%d, limitado a %d)";
"Modland (%d)" = "Modland (%d)";
"Modland/Search off" = "Modland/Busca desativada";

"HVSC (%d, limited to %d)" = "HVSC (%d, limitado a %d)";
"HVSC (%d)" = "HVSC (%d)";
"HVSC/Search off" = "HVSC/Busca desativada";

"ASMA (%d, limited to %d)"="ASMA (%d, limitado a %d)";
"ASMA (%d)"="ASMA (%d)";
"ASMA/Search off"="ASMA/Busca desativada";

/* Search Messages */
"Searching Playlists..." = "Buscando Playlists...";
"Searching Local files..." = "Buscando arquivos locais...";
"Searching MODLAND..." = "Buscando MODLAND...";
"Searching HVSC..." = "Buscando HVSC...";

"Please enter at least 2 characters for your search." = "Digite pelo menos 2 caracteres para sua busca.";
"Please activate at least 1 section for your search." = "Ative pelo menos 1 seção para sua busca.";


// ================================
// MARK: - PLAYER / NOW PLAYING
// ================================

/* Player States */
"Now playing" = "Tocando agora";
"Now playing(%d)" = "Tocando agora(%d)";
"Most played" = "Mais tocadas";
"Favorites" = "Favoritos";
"Resuming last\nplayed file" = "Retomando último\narquivo tocado";

/* Player Controls */
"Previous" = "Anterior";
"Previous file" = "Arquivo anterior";
"Next file" = "Próximo arquivo";
"Next" = "Próximo";
"Shuffle" = "Aleatório";
"Voices control" = "Controle de vozes";
"All voices" = "Todas as vozes";
"Clear 'Now Playing' queue" = "Limpar fila 'Tocando agora'";

/* Song Selection */
"Choose a subsong" = "Escolha uma subfaixa";
"Choose a song" = "Escolha uma música";

/* Player Messages */
"Nothing currently playing. Please select a file." = "Nada tocando no momento. Selecione um arquivo.";
"File cannot be played. Skipping to next playable file." = "Arquivo não pode ser reproduzido. Pulando para próximo arquivo.";
"Too much entries! Playlist will be limited to %d first entries." = "Entradas demais! Playlist será limitada às primeiras %d entradas.";
"Playlist is full. Delete some entries to add more." = "Playlist cheia. Exclua algumas entradas para adicionar mais.";

/* Metadata */
"unknown_title" = "Título desconhecido";
"unknown_album" = "Álbum desconhecido";
"now_playing_format" = "Tocando: %@ de %@";


// ================================
// MARK: - PLAYLISTS
// ================================

/* Playlist Actions */
"New playlist" = "Nova playlist";
"Create new playlist" = "Criar nova playlist";
"Save current one" = "Salvar atual";
"Rename playlist" = "Renomear playlist";
"Add to a playlist" = "Adicionar a uma playlist";
"Choose a playlist" = "Escolha uma playlist";

/* Playlist Descriptions */
"Create a new empty playlist." = "Criar nova playlist vazia.";
"Create a playlist from currently played files." = "Criar playlist dos arquivos tocados atualmente.";
"Browse files" = "Navegar arquivos";
"Add or remove entries from browser." = "Adicionar ou remover entradas do navegador.";
"Choose a new name." = "Escolha um novo nome.";

/* Playlist Confirmations */
"Are you sure you want to delete this playlist ?" = "Tem certeza que deseja excluir esta playlist?";
"Are you sure you want to delete this entry ?" = "Tem certeza que deseja excluir esta entrada?";


// ================================
// MARK: - DOWNLOADS
// ================================

"Downloads" = "Downloads";
"Download queue: 1 file" = "Fila de download: 1 arquivo";
"Download queue: %d files" = "Fila de download: %d arquivos";
"No download in progress" = "Nenhum download em andamento";
"Downloaded %@" = "Baixado %@";
"Downloading %@" = "Baixando %@";
"Cannot download from this URL." = "Não é possível baixar desta URL.";
"Could not add files. Please check manually with file browser (Local Browsing/Downloads)." = "Não foi possível adicionar arquivos. Verifique manualmente no navegador (Navegação Local/Downloads).";
"File already available locally. Do you want to download it again?" = "Arquivo já disponível localmente. Deseja baixar novamente?";
"URL have to start with ftp:// or http://" = "URL deve começar com ftp:// ou http://";
"Cannot connect to FTP." = "Não foi possível conectar ao FTP.";


// ================================
// MARK: - DATABASE
// ================================

"Database created." = "Banco de dados criado.";
"Database will now be recreated. Please validate & wait." = "Banco de dados será recriado. Valide e aguarde.";
"Wrong database version: %d.%d. Will update to %d.%d. Please validate & wait." = "Versão incorreta do banco: %d.%d. Será atualizado para %d.%d. Valide e aguarde.";
"No database found. Will create a new one. Please validate & wait..." = "Nenhum banco encontrado. Será criado um novo. Valide e aguarde...";


// ================================
// MARK: - COVERS / IMAGES
// ================================

"Image detected" = "Imagem detectada";
"Choose_SaveCover" = "Salvar imagem como capa de %@?";
"CoverFolder" = "Como capa da Pasta";
"CoverFile" = "Como capa do Arquivo";
"Confirm_RemCurCovers" = "Remover capas atuais de %@ (pasta e arquivo)?";


// ================================
// MARK: - SETTINGS - GENERAL
// ================================

/* Settings Sections */
"Settings_General" = "Geral";
"Settings_Player" = "Reprodutor";
"Settings_Display" = "Exibição";
"Settings_Download" = "Download";
"Settings_FTP" = "FTP";
"Settings_PlaybackLib" = "Bibliotecas de reprodução";
"Settings_Settings" = "Configurações";

/* Settings Presets */
"Settings_SettingsDefault" = "Padrão";
"Settings_SettingsHigh" = "Alto";
"Settings_SettingsMed" = "Médio";
"Settings_SettingsLow" = "Baixo";

"Confirm_SettingsDef" = "Tem certeza que deseja redefinir as configurações com valores 'padrão'?";
"Confirm_SettingsHigh" = "Tem certeza que deseja redefinir as configurações com valores 'altos'?";
"Confirm_SettingsMed" = "Tem certeza que deseja redefinir as configurações com valores 'médios'?";
"Confirm_SettingsLow" = "Tem certeza que deseja redefinir as configurações com valores 'baixos'?";

/* Global Player Settings */
"Search: simplified regexp ('.'->'\\.', '*'->'.*')" = "Busca: regexp simplificado ('.'->'\\.', '*'->'.*')";
"Resume position on launch" = "Retomar posição ao iniciar";
"Notification" = "Notificação";
"Notification duration" = "Duração da notificação";
"Disable screen auto lock" = "Desativar bloqueio automático";
"No screen auto lock" = "Sem bloqueio automático";
"Enable playback ratio" = "Ativar taxa de reprodução";
"Playback ratio" = "Taxa de reprodução";
"Default length" = "Duração padrão";
"Default length %d:%.2d" = "Duração padrão %d:%.2d";
"Fade-out time" = "Tempo de fade-out";
"Silence Detection" = "Detecção de Silêncio";
"Stop song if silent for more than selected number of seconds. 0: off" = "Parar música se silenciosa por mais que o número selecionado de segundos. 0: desligado";
"Will skip song if nothing is played for specified duration (0=off)" = "Pulará música se nada for tocado pela duração especificada (0=desligado)";
"Force mono" = "Forçar mono";
"Panning" = "Panorama";
"Panning value" = "Valor de panorama";
"Audio latency" = "Latência de áudio";
"Audio latency in ms" = "Latência de áudio em ms";
"Multi default action" = "Ação padrão múltipla";
"Browse" = "Navegar";
"Archive/multi play mode" = "Modo de arquivo/múltiplas faixas";
"Entry"="Entrada";

/* Archive Settings */
"Archive multi default action" = "Ação padrão de arquivo múltiplo";
"Archive multi play mode" = "Modo de reprodução de arquivo múltiplo";

/* Playlist Settings */
"Play/Enqueue action" = "Ação Reproduzir/Enfileirar";
"Enqueue mode" = "Modo de enfileiramento";
"Default Action" = "Ação Padrão";
"Play" = "Reproduzir";
"Enqueue" = "Enfileirar";
"Enq.&Play" = "Enfil.&Reprod.";
"First" = "Primeiro";
"Current" = "Atual";
"Last" = "Último";
"Enqueue position" = "Posição de enfileiramento";
"Post download action" = "Ação pós-download";
"Nothing" = "Nada";

/* Display Settings */
"Background mode" = "Modo em segundo plano";
"Partial" = "Parcial";
"Full" = "Total";
"Off=no background process, Partial=keep playing music, Full=keep app on in background" = "Deslig.=sem processo em segundo plano, Parcial=continuar tocando, Total=manter app ativo";
"Long name truncate" = "Truncar nome longo";
"Head" = "Início";
"Mid." = "Meio";
"Tail" = "Fim";
"Filename as title" = "Nome do arquivo como título";

/* Local Files Settings */
"Auto. restore Samples folder" = "Restaurar pasta Samples automaticamente";
"Send statistics" = "Enviar estatísticas";


// ================================
// MARK: - SETTINGS - DATABASE
// ================================

"Settings_DB" = "Banco de Dados";
"Settings_CleanDB" = "Limpar Banco de Dados";
"Settings_ResetPlCnt" = "Redefinir contadores de reprodução";
"Settings_ResetRatings" = "Redefinir Avaliações";
"Settings_ResetDB" = "Redefinir banco inteiro";

"Confirm_DBClean" = "Iniciar limpeza do banco de dados (pode demorar)?";
"Confirm_Reset_PlCnt" = "Tem certeza que deseja redefinir todos os contadores de reprodução?";
"Confirm_Reset_Ratings" = "Tem certeza que deseja redefinir todas as avaliações?";
"Confirm_ResetDB" = "Tem certeza que deseja redefinir todo o banco? Playlists, avaliações e contadores serão excluídos.";


// ================================
// MARK: - SETTINGS - LOCAL FILES
// ================================

"Settings_LocalFiles" = "Arquivos Locais";
"Settings_RecreateSamples" = "Recriar pasta 'Samples'";
"Settings_FormatDownloads" = "Formatar pasta 'Downloads'";
"Settings_RemCovers" = "Remover capas";
"Settings_UpdateFilesBackupFlag" = "Verificar Sistema de Arquivos";

"Confirm_RecreateSamples" = "Deseja recriar a pasta 'Samples'.";
"Confirm_FormatDownloads" = "Deseja remover TODOS os arquivos da pasta Navegação Local/Web.";
"Confirm_CheckFiles" = "Deseja realizar verificação do sistema de arquivos local?";


// ================================
// MARK: - SETTINGS - PLUGINS
// ================================

/* AdPlug */
"OPL type" = "Tipo OPL";
"Stereo surround" = "Estéreo surround";

/* GBSPlay */
"HP filter type" = "Tipo de filtro HP";
"Highpass filter type" = "Tipo de filtro passa-alta";

/* Game Music Emu (GME) */
"Stereo separation" = "Separação estéreo";
"Ignore silence" = "Ignorar silêncio";
"Silence detection" = "Detecção de silêncio";
"Equalizer" = "Equalizador";
"Bass" = "Graves";
"Treble" = "Agudos";

/* GSF */
"Sound quality" = "Qualidade de som";
"Interpolation" = "Interpolação";
"Low-pass filter" = "Filtro passa-baixa";
"Echo" = "Eco";

/* Highly Complete (HC) */
"Resample quality" = "Qualidade de reamostragem";
"Main enabled" = "Principal ativado";
"Reverb enabled" = "Reverberação ativada";

/* NSFPlay */
"NSFPLAY default length" = "Duração padrão NSFPLAY";
"LPF strength" = "Força LPF";
"Min=off, default: 112" = "Mín=deslig., padrão: 112";
"HPF strength" = "Força HPF";
"Region" = "Região";
"VRC7 Patches" = "Patches VRC7";
"Force IRQ" = "Forçar IRQ";
"Quality" = "Qualidade";

/* OpenMPT */
"Master volume" = "Volume principal";
"Sampling" = "Amostragem";
"Resampling" = "Reamostragem";

/* SID */
"Engine" = "Motor";
"Filter" = "Filtro";
"Force loop" = "Forçar loop";
"Clock" = "Clock";
"Model" = "Modelo";
"Force 2nd SID" = "Forçar 2º SID";
"Address 2nd" = "Endereço 2º";
"0xD420-0xD7FF or 0xDE00-0xDFFF" = "0xD420-0xD7FF ou 0xDE00-0xDFFF";
"Force 3rd SID" = "Forçar 3º SID";
"Address 3rd" = "Endereço 3º";

/* Timidity */
"Max loop" = "Loop máx.";
"MIDI polyphony" = "Polifonia MIDI";
"Amplification" = "Amplificação";
"Chorus" = "Chorus";
"Reverb" = "Reverberação";
"Resample" = "Reamostrar";
"LP filter" = "Filtro LP";

/* UADE */
"Headphones" = "Fones de ouvido";
"LED filter" = "Filtro LED";
"Normalization" = "Normalização";
"Post FX" = "Pós FX";
"Panning" = "Panorama";
"Panning value" = "Valor de panorama";
"Gain" = "Ganho";
"Gain value" = "Valor de ganho";
"Force NTSC" = "Forçar NTSC";

/* VGMPlay */
"Prefer JTAG" = "Preferir JTAG";
"YM2612 emulator" = "Emulador YM2612";
"Nuked OPN2 option" = "Opção Nuked OPN2";
"YMF262 emulator" = "Emulador YMF262";
"YM3812 emulator" = "Emulador YM3812";
"QSound emulator" = "Emulador QSound";
"RF5C68 emulator" = "Emulador RF5C68";

/* VGMStream */
"Max loop" = "Loop máx.";

/* XMP */
"Amiga 500 Filter" = "Filtro Amiga 500";


// ================================
// MARK: - SETTINGS - VISUALIZATIONS
// ================================

/* General FX */
"FX Alpha" = "Alfa FX";
"FX Fullscreen" = "FX Tela Cheia";
"FX FPS" = "FPS FX";
"FX show info" = "FX mostrar info";
"Tech Info" = "Info Técnica";
"Show FPS and other infos (CPU, Resolution, ProjectM audio data)" = "Mostrar FPS e outras infos (CPU, Resolução, dados de áudio ProjectM)";
"FX Level of details" = "FX Nível de detalhes";
"Low" = "Baixo";
"Med" = "Médio";
"High" = "Alto";
"Slow FX limit" = "Limite FX lento";
"Deactivate FX if too slow." = "Desativar FX se muito lento.";
"Weak" = "Fraco";
"Strong" = "Forte";
"Display song info" = "Exibir info da música";
"When in fulllscreen, display song info when it changes. TL is Top Left, DR is Bottom Right, C is Center." = "Em tela cheia, exibir info da música quando mudar. TL é Superior Esquerdo, DR é Inferior Direito, C é Centro.";

/* ProjectM */
"ProjectM settings" = "Configurações ProjectM";
"ProjectM on/off" = "ProjectM lig/deslig";
"Show preset label" = "Mostrar rótulo de preset";
"Auto switch presets mode" = "Modo troca automática de presets";
"Lock preset" = "Travar preset";
"Time between preset" = "Tempo entre presets";
"Blend presets" = "Misturar presets";
"Blend time" = "Tempo de mistura";
"Bundled presets" = "Presets inclusos";
"Custom presets" = "Presets personalizados";
"Aspect ratio" = "Proporção de tela";
"Mesh size X" = "Tamanho de malha X";
"Mesh size Y" = "Tamanho de malha Y";
"Hard cut enabled" = "Hard cut ativado";
"Hard cut min time" = "Tempo mín. hard cut";
"Hard cut sensitivity" = "Sensibilidade hard cut";
"Beat sensitivity" = "Sensibilidade de batida";
"Permissive mode" = "Modo permissivo";

/* Oscilloscope */
"Oscillo settings" = "Configurações Osciloscópio";
"FX mode" = "Modo FX";
"Show label" = "Mostrar rótulo";
"Label font size" = "Tamanho da fonte do rótulo";
"Show grid" = "Mostrar grade";
"Grid color" = "Cor da grade";
"Line width" = "Largura da linha";
"Mono color" = "Cor mono";
"Multi color set" = "Conjunto multi-cor";
"Reset all colors" = "Redefinir todas as cores";
"Thin" = "Fino";
"Medium" = "Médio";
"Thick" = "Grosso";
"Beefy" = "Muito grosso";

/* Piano Roll / MIDI */
"Piano roll" = "Piano roll";
"Activate Piano roll FX, standard or 'Synthesia' like" = "Ativar FX Piano roll, padrão ou tipo 'Synthesia'";
"Activate spark FX, colored or white" = "Ativar FX de faísca, colorido ou branco";
"Display voices labels" = "Exibir rótulos de vozes";
"Display octaves labels" = "Exibir rótulos de oitavas";
"MIDI pattern" = "Padrão MIDI";
"MIDI cut line" = "Linha de corte MIDI";
"MIDI bar style" = "Estilo de barra MIDI";
"MIDI bar vibrato" = "Vibrato de barra MIDI";
"Piano 3D" = "Piano 3D";
"Piano cut line" = "Linha de corte piano";
"Piano color mode" = "Modo de cor piano";

/* Spectrum */
"3D spectrum" = "Spectrum 3D";
"3D spectrum bloom" = "Bloom spectrum 3D";
"Spectrum" = "Spectrum";
"3D landscape" = "Paisagem 3D";
"3D landscape bloom" = "Bloom paisagem 3D";

/* MOD Pattern */
"MOD pattern" = "Padrão MOD";
"MOD pattern BG alpha" = "Alfa de fundo padrão MOD";
"MOD pattern vol bar" = "Barra vol. padrão MOD";
"MOD pattern current line mode" = "Modo linha atual padrão MOD";
"MOD pattern font" = "Fonte padrão MOD";
"MOD pattern font size" = "Tamanho fonte padrão MOD";
"MOD pattern theme" = "Tema padrão MOD";


// ================================
// MARK: - WEB BROWSER
// ================================

"Browser_Welcome_Message" = "<b>Bem-vindo ao navegador web do Modizer!</b><br><br>Use a barra de endereços acima para navegar ou explore seus favoritos.<br><br>Para usar uma imagem como capa, copie-a para a área de transferência com um toque longo.";
"Bookmarks" = "Favoritos";


// ================================
// MARK: - ABOUT
// ================================

"About_Text" = "v4.2 © Yohann Magnien / YoyoFR\n\nContato: mailto:modizerhelp@gmail.com\nWeb: https://modizer.app\n\nLogo do Modizer por Steve Miele.\n\nNúmero de formatos/extensões de arquivo suportados: 1090.\n!PM!,04SW,208,2DX9,2PSF,2SF,2SFLIB,3DO,4,40A,40B,41A,50A,60A,61A,669,800,9TAV,A2M,AAC,AAM,AAX,ABK,AC1,AC1D,ACB,ACM,ACX,ADL,ADLIB,ADM,ADP,ADPCM,ADPCMX,ADS,ADSC,ADW,ADX,AFC,AFS2,AGD,AGI,AGSC,AHV,AHX,AI,AIF,AIF-LOOP,AIFC,AIFCL,AIFF,AIFFL,AIX,AKB,AL,AL2,ALP,AMC,AMD,AMF,AMS,AMTS,AO,AON,AON4,AON8,AP,APC,APE,AS0,AS3M,AS4,ASC,ASD,ASF,ASR,ASS,AST,AT3,AT9,ATSL,ATSL3,ATSL4,ATX,AUD,AUS,AVAL,AVP,AWB,AWC,AY,B1S,BAF,BAKA,BAM,BANK,BAO,BAR,BCSTM,BCWAV,BD,BD3,BDS,BDSP,BFC,BFSTM,BFWAV,BFWAVNSMBU,BG00,BGM,BGW,BH2PCM,BIK,BIK2,BIKA,BIN,BK2,BLK,BMDX,BMF,BMS,BNK,BNM,BNS,BNSF,BO2,BP,BP3,BRSTM,BRSTMSPM,BSF,BSI,BSND,BSS,BTSND,BVG,BWAV,BYTES,C64,C67,CAF,CAPDSP,CBD2,CC3,CCC,CD,CFF,CFN,CHAN,CHI,CHK,CHP,CIN,CKB,CKD,CKS,CM,CM3,CMC,CMF,CMR,CMS,CNK,COP,CORE,CP,CPK,CPLX,CPS,CRB,CSB,CSMP,CTRL,CUS,CUST,CUSTOM,CVS,CWAV,CXS,D00,DA,DAT,DATA,DAX,DB,DBM,DCS,DCT,DDSP,DE2,DEC,DFM,DH,DI,DIGI,DIVA,DL,DLM1,DLM2,DLN,DLT,DL_DELI,DM0,DM1,DM2,DMC,DMF,DMM,DMO,DMSG,DMU,DMU2,DNS,DODA,DP,DR0,DRO,DS2,DSB,DSC,DSF,DSFLIB,DSM,DSP,DSPW,DSQ,DSR,DSS,DST,DTK,DTM,DUM,DVI,DW,DWOLD,DXH,DZ,E4X,EA,EAM,EAS,EMFF,EMOD,EMS,EMSV6,ENM,ENO,ENS,ESV,ET1,EU,EUP,EX,EXA,EZW,FAG,FAR,FC,FC-BSI,FC-M,FC13,FC14,FC3,FC4,FCM,FDA,FDI,FFW,FILP,FLAC,FLX,FMB,FNK,FP,FRED,FSB,FSV,FT,FTC,FUZ,FUZZ,FW,FWAV,FWSE,G1L,GAM,GAMPLUS,GBR,GBS,GBTS,GCA,GCM,GCUB,GCW,GDM,GENH,GIN,GLUE,GM,GMC,GMS,GOT,GRAY,GSB,GSF,GSFLIB,GTD,GTR,GV,GWM,GYM,H4M,HA2,HAB,HBT,HCA,HD,HDR,HES,HGC1,HIP,HIP7,HIPC,HIS,HMC,HN,HPS,HRM,HRP,HRT,HRT!,HSC,HSF,HSP,HSQ,HST,HVL,HWAS,HX2,HX3,HXC,HXD,HXG,HXX,IAB,IADP,ICE,IDMSF,IDSP,IDVI,IDWAV,IDXMA,IFS,IKM,ILD,IMA,IMC,IMF,IMS,IMX,INSTR,INT,IS,IS14,IS20,ISB,ISD,ISWS,IT,IT1,ITL,IVAG,IVAUD,IVB,J2B,JAM,JBM,JC,JCB,JCBO,JD,JMF,JO,JOE,JP,JPN,JPND,JPO,JPOLD,JSTM,JT,KAT,KCES,KCEY,KEF,KEF7,KH,KM9,KNS,KOVS,KRAW,KRIS,KRS,KSM,KSS,KTAC,KTSL2ASBIN,KTSS,KVS,L,LAA,LAAC,LAIF,LAIFC,LAIFF,LASF,LAX,LBIN,LDS,LEG,LEP,LIN,LIQ,LM0,LM1,LM2,LM3,LM4,LM5,LM6,LM7,LME,LMP3,LMP4,LOGG,LOPUS,LP,LPCM,LPK,LPS,LRMB,LSE,LSF,LSTM,LWAV,LZS,M,M15,M2,M3U,M4A,M4V,MA,MAB,MAD,MAP,MATX,MAX,MBM,MC,MC3,MCA,MCADPCM,MCG,MCMD,MCMD_ORG,MCO,MCR,MD,MDAT,MDI,MDL,MDS,MDSP,MDST,MDX,MDY,MED,MEXXMP,MFP,MG,MGS,MI4,MIB,MIC,MID,MIDI,MIHB,MINI2SF,MINIDSF,MINIGSF,MININCSF,MINIPSF,MINIPSF2,MINIQSF,MINISNSF,MINISSF,MINIUSF,MJB,MK2,MKF,MKII,MKIIO,MKJ,ML,MM4,MM8,MMCMP,MMD0,MMD1,MMD2,MMD3,MMD4,MMDC,MMS,MNSTR,MO3,MOD,MOD15,MOD15_MST,MOD15_ST-IV,MOD15_UST,MOD_ADSC4,MOD_COMP,MOD_DOC,MOD_FLT4,MOD_NTK,MOD_NTK1,MOD_NTK2,MOD_NTKAMP,MOGG,MOK,MON,MON_OLD,MP3,MP4,MPD,MPDSP,MPF,MPG,MPK,MPRO,MPT,MPTM,MS,MSA,MSADPCM,MSB,MSC,MSD,MSF,MSO,MSP,MSS,MSV,MSVP,MT2,MTA2,MTAF,MTK,MTM,MTP2,MTR,MUG,MUG2,MUL,MUPS,MUS,MUSC,MUSX,MW,MWV,MXST,MYSPD,MZ,N64,NAAC,NCSF,NCSFLIB,NDP,NDS,NGCA,NLSD,NOISEPACKER2,NOISEPACKER3,NOP,NP,NP1,NP2,NP3,NPS,NPSF,NR,NRU,NSF,NSFE,NSOPUS,NST,NTP,NTPK,NUB,NUB2,NUS3AUDIO,NUS3BANK,NWA,NWAV,NXA,OCTAMED,OGG,OGL,OKT,OMU,ONE,OPI,OPUS,OPUSX,OPX,ORG,OSP,OTM,OVB,OVI,OXM,OZI,P,P00,P10,P21,P2BT,P30,P3D,P40A,P40B,P41A,P4X,P50A,P5A,P5X,P60,P60A,P61,P61A,P6X,P86,PAP,PAST,PCD,PCM,PDT,PDX,PFLT,PHA,PIN,PIS,PK,PLM,PM,PM0,PM01,PM1,PM10C,PM18A,PM2,PM20,PM4,PM40,PMB,PMZ,PNB,POLK,PONA,POS,POWT,PP10,PP20,PP21,PP30,PPC,PPK,PPM,PPS,PPZ,PR1,PR2,PRG,PROM,PRU,PRU1,PRU2,PRUN,PRUN1,PRUN2,PS,PS2STM,PSA,PSC,PSF,PSF2,PSF2LIB,PSFLIB,PSG,PSH,PSID,PSM,PSND,PSW,PT,PT1,PT2,PT3,PT36,PTCOP,PTM,PTTUNE,PUMA,PVI,PVP,PWR,PXA,PYG,PYGM,PYGMY,PZI,QC,QPA,QSF,QSFLIB,QTS,R,RAC,RAD,RAK,RAS,RAW,RH,RHO,RIFF,RIX,RJP,RK,RKB,RKV,RMT,RND,ROF,ROL,RPGMVO,RRDS,RSD,RSF,RSID,RSM,RSP,RSTM,RTM,RWAR,RWAV,RWS,RWSD,RWX,RXW,S-C,S14,S3M,S7G,S98,S98xxxxxxxxx,SA,SA-P,SA2,SAB,SAD,SAF,SAP,SAS,SAT,SA_OLD,SB,SB0,SB1,SB2,SB3,SB4,SB5,SB6,SB7,SBIN,SBK,SBR,SBV,SC,SC68,SCD,SCH,SCI,SCL,SCN,SCR,SCT,SCUMM,SD9,SDB,SDF,SDR,SDT,SEB,SED,SEG,SF0,SF2,SFL,SFM,SFS,SFX,SFX13,SFX2,SG,SGB,SGC,SGD,SGX,SID,SID1,SID2,SJS,SKT,SKYT,SL3,SLI,SM,SM0,SM1,SM2,SM3,SM4,SM5,SM6,SM7,SMC,SMK,SMN,SMP,SMPL,SMPRO,SMUS,SMV,SND,SNDH,SNDMON,SNDS,SNG,SNGW,SNK,SNR,SNS,SNSF,SNSFLIB,SNT,SNT!,SNU,SNX,SOC,SOD,SOG,SON,SONIC,SOP,SPC,SPD,SPK,SPL,SPM,SPS,SPSD,SPW,SQD,SQT,SQX,SS,SS2,SSF,SSFLIB,SSM,SSS,ST,ST1,ST2,ST26,ST3,ST30,STAR,STC,STER,STK,STM,STMA,STP,STPK,STR,STREAM,STRM,STS,STX,SUN,SVAG,SVG,SVS,SWAG,SWAV,SWD,SWITCH_AUDIO,SX,SXD,SXD1,SXD2,SXD3,SYN,SYNMOD,SZX,TD0,TEC,TF,TF0,TFC,TFD,TFE,TFHD1.5,TFHD7V,TFHDPRO,TFMX,TFMX1.5,TFMX7V,TFMXPRO,TGQ,TGV,THM,THN,THP,THX,TINY,TK5,TLZ,TLZP,TM2,TM8,TMC,TME,TMX,TP,TP1,TP2,TP3,TPU,TRA,TRC,TRD,TRO,TRONIC,TRS,TS,TUN,TW,TWO,TXT,TXTH,TXTP,TYDSP,UDS,UE4OPUS,ULT,ULW,UM3,UMX,UN2,UNIC,UNIC2,USF,USFLIB,UTK,UV,V0,V1,V2M,V2MZ,VA3,VAG,VAI,VAS,VAWX,VB,VBK,VDM,VDS,VGM,VGS,VGV,VGZ,VID,VIG,VIS,VMS,VOI,VP6,VPK,VS,VSF,VSS,VSV,VTX,VXN,WAA,WAC,WAD,WAF,WAM,WAS,WAV,WAVC,WAVE,WAVEBATCH,WAVM,WAY,WB,WB2,WBD,WD,WEM,WII,WLF,WMA,WMUS,WN,WOW,WP2,WPD,WSD,WSI,WSR,WUA,WV2,WV6,WVE,WVS,WVX,X,XA,XA2,XA30,XAD,XAG,XAN,XANN,XAU,XAV,XEN,XM,XMA,XMA2,XMD,XMU,XNA,XNB,XOPUS,XPK,XPS,XSE,XSEW,XSF,XSM,XSS,XVAG,XVAS,XWAV,XWB,XWC,XWM,XWMA,XWS,XWV,YDSP,YM,YMF,ZEN,ZIC,ZSD,ZSM,ZSS,ZWDSP,ZWV,ZXZIP\nBibliotecas de reprodução integradas:\n- Adplug\n- Another Slight Atari Player(ASAP)\n- AtariSound\n- Eupmini\n- ffmpeg/mpg123/vorbis\n- Game Music Emu\n- FMPmini\n- Highly Complete\n- AHX/Hively tracker\n- LazyUSF\n- Libvgm\n- Mdxplay\n- NSFPlay\n- OpenMPT\n- PlayGSF\n- Pmdmini\n- PxTone / Organya\n- PT3Player\n- SC68\n- Sibplayfp\n- Snes9x/snsf\n- ST-Sound\n- Timidity(usando soundfont Merlin_gold SF2)\n- UADE\n- XSF (2SF, NCSF)\n- XMP\n-V2M tinyplayer\n- VGMStream\n- VIO2SF\n- WebSID\n- ZXTune\n\nIsenção de responsabilidade:\nAcessos à Internet às bibliotecas Modland, HVSC e ASMA são fornecidos como um serviço tal como está, não há garantia de disponibilidade e/ou funcionalidade. Use este aplicativo por sua conta e risco.";


// ================================
// MARK: - SUPPORT
// ================================

"Mail support" = "Suporte por email";
"Contact support by email" = "Entrar em contato com suporte por email";
"[Please describe your request below]" = "[Descreva sua solicitação abaixo]";


// ================================
// MARK: - DONATION / TIPS
// ================================

"Thank You! ❤️" = "Obrigado! ❤️";
"Send a tip to Modizer" = "Enviar uma gorjeta ao Modizer";
"Support Modizer development" = "Apoiar desenvolvimento do Modizer";


// ================================
// MARK: - LAUNCH / INITIALIZATION
// ================================

"Cleaning DB & \nreseting settings" = "Limpando BD e\nredefinindo configurações";
"First launch or issue encountered last time Modizer was running. Apply default settings?" = "Primeiro lançamento ou problema encontrado na última vez que o Modizer estava rodando. Aplicar configurações padrão?";


// ================================
// ================================
// MARK: - SIRI / APP INTENTS
// ================================

/* Títulos de intenções */
"Play" = "Reproduzir";
"Pause" = "Pausar";
"Stop" = "Parar";
"Next Song" = "Próxima música";
"Previous Song" = "Música anterior";
"Play Subsong" = "Reproduzir submúsica";
"Seek" = "Buscar";
"Set Infinite Loop" = "Definir loop infinito";
"Set Loop Mode" = "Definir modo de repetição";
"Set Shuffle Mode" = "Definir modo aleatório";
"Toggle Shuffle" = "Alternar aleatório";
"Toggle Loop Mode" = "Alternar modo de repetição";
"Set Fullscreen mode" = "Definir modo tela cheia";
"Go the player view" = "Ir para a visualização do player";
"Set FX" = "Definir FX";
"Get Now Playing" = "Obter reprodução atual";
"Get Playlists" = "Obter playlists";
"Play some music" = "Reproduzir música";
"Play most played" = "Reproduzir mais tocadas";
"Play favorites" = "Reproduzir favoritas";
"Play Playlist" = "Reproduzir playlist";
"Play Playlist By Name" = "Reproduzir playlist por nome";

/* Descrições de intenções */
"Starts playing music in Modizer." = "Inicia a reprodução de música no Modizer.";
"Pauses music playback in Modizer." = "Pausa a reprodução de música no Modizer.";
"Stops music playback in Modizer." = "Para a reprodução de música no Modizer.";
"Skips to the next song in Modizer." = "Pula para a próxima música no Modizer.";
"Skips to the previous song in Modizer." = "Pula para a música anterior no Modizer.";
"Plays a specific subsong in the current file." = "Reproduz uma submúsica específica no arquivo atual.";
"Seeks to a specific position in the current song." = "Busca uma posição específica na música atual.";
"Set the infinite loop mode in Modizer." = "Define o modo de loop infinito no Modizer.";
"Set the loop mode in Modizer." = "Define o modo de repetição no Modizer.";
"Set the shuffle mode in Modizer." = "Define o modo aleatório no Modizer.";
"Toggles shuffle mode in Modizer." = "Alterna o modo aleatório no Modizer.";
"Toggles loop mode in Modizer." = "Alterna o modo de repetição no Modizer.";
"Set Fullscreen mode on or off in Modizer." = "Ativa ou desativa o modo de tela cheia no Modizer.";
"Go the player view in Modizer." = "Vai para a visualização do player no Modizer.";
"Set FX mode in Modizer." = "Define o modo FX no Modizer.";
"Gets information about the currently playing song." = "Obtém informações sobre a música em reprodução.";
"Gets the list of available playlists in Modizer." = "Obtém a lista de playlists disponíveis no Modizer.";
"Random picks from available local titles in Modizer." = "Seleções aleatórias de títulos locais disponíveis no Modizer.";
"Most played titles from available local titles in Modizer." = "Títulos mais tocados de títulos locais disponíveis no Modizer.";
"Favorites titles from available local titles in Modizer." = "Títulos favoritos de títulos locais disponíveis no Modizer.";
"Plays a specific playlist in Modizer. Note: For best results with voice commands, use 'Play Playlist By Name' instead." = "Reproduz uma playlist específica no Modizer. Nota: Para melhores resultados com comandos de voz, use 'Reproduzir playlist por nome' em vez disso.";
"Plays a playlist by name in Modizer. Recommended for voice commands." = "Reproduz uma playlist por nome no Modizer. Recomendado para comandos de voz.";

/* Parâmetros */
"Subsong Index" = "Índice de submúsica";
"The index of the subsong to play" = "O índice da submúsica a reproduzir";
"Position (seconds)" = "Posição (segundos)";
"The position to seek to in seconds" = "A posição a buscar em segundos";
"Relative" = "Relativo";
"Whether to seek relative to current position" = "Se deve buscar relativo à posição atual";
"Infinite Loop Mode" = "Modo de loop infinito";
"0: off, 1: infinite loop" = "0: desligado, 1: loop infinito";
"Repeat Mode" = "Modo de repetição";
"0: off, 1: loop current title, 2: loop playlist" = "0: desligado, 1: repetir título atual, 2: repetir playlist";
"Shuffle Mode" = "Modo aleatório";
"0: off, 1: choose only one title if file has subsongs or is an archive, 2: play all titles of a given file" = "0: desligado, 1: escolher apenas um título se o arquivo tiver submúsicas ou for um arquivo, 2: reproduzir todos os títulos de um arquivo";
"Fullscreen mode" = "Modo tela cheia";
"Activate (1) or disactivate (0) Fullscreen mode" = "Ativar (1) ou desativar (0) o modo de tela cheia";
"FX" = "FX";
"The FX to set" = "O FX a definir";
"FX Mode" = "Modo FX";
"The mode to activate for the selected FX (0:off)" = "O modo a ativar para o FX selecionado (0:desligado)";
"Playlist" = "Playlist";
"The playlist to play" = "A playlist a reproduzir";
"Start Index" = "Índice inicial";
"The index of the song to start playing from (0-based)" = "O índice da música a partir da qual começar a reprodução (base 0)";
"Playlist Name" = "Nome da playlist";
"The name of the playlist to play" = "O nome da playlist a reproduzir";
"Which playlist would you like to play?" = "Qual playlist você gostaria de reproduzir?";

/* Mensagens de diálogo */
"play_playlist_dialog" = "Reproduzindo playlist %@";
"Playlist not found. Use 'Get Playlists' to see available playlists." = "Playlist não encontrada. Use 'Obter playlists' para ver as playlists disponíveis.";
"No playlists found" = "Nenhuma playlist encontrada";

/* Nomes de FX */
"ProjectM" = "ProjectM";
"Oscillo" = "Osciloscópio";
"Piano roll" = "Rolo de piano";
"3D Piano" = "Piano 3D";
"Notes bars" = "Barras de notas";
"Tracker" = "Rastreador";
"2D Spectrum" = "Spectrum 2D";
"3D Spectrum" = "Spectrum 3D";
"3D Landscape" = "Paisagem 3D";

// ================================

"Get Now Playing" = "Obter Tocando Agora";
"Which playlist would you like to play?" = "Qual playlist você gostaria de reproduzir?";


// ================================


// ================================
// MARK: - VOICE COMMANDS UI
// ================================

"Voice Commands" = "Comandos de voz";
"Siri voice commands for Modizer" = "Comandos de voz Siri para Modizer";
"Voice Commands: Playback" = "Reprodução";
"Voice Commands: Navigation" = "Navegação";
"Voice Commands: Playlists" = "Listas de reprodução";
"Voice Commands: Modes" = "Modos";
// MARK: - TABS
// ================================

"Search" = "Buscar";
"More" = "Mais";
"Suspend" = "Suspender";
"Clear all" = "Limpar tudo";
"Online" = "Online";


// ================================
// MARK: - MORE TAB
// ================================

"About" = "Sobre";
"Some general informations" = "Informações gerais";
"Settings" = "Configurações";
"Global, Visu, FTP & Plugins" = "Global, Visu, FTP e Plugins";
"Maintenance" = "Manutenção";
"Clean DB, Reset ratings, ..." = "Limpar BD, Redefinir avaliações, ...";


// ================================
// MARK: - ONLINE TAB / COLLECTIONS
// ================================

/* Section Headers */
"Collections" = "Coleções";
"Browse Internet" = "Navegar na Internet";
"Games Music" = "Músicas de Games";
"Mods & chiptunes" = "Mods e chiptunes";
"Other" = "Outros";

/* Collections */
"MODLAND collection" = "Coleção MODLAND";
"AMP collection" = "Coleção AMP";
"HVSC collection" = "Coleção HVSC";
"ASMA collection" = "Coleção ASMA";
"JOSHW collection" = "Coleção JOSHW";
"VGMRips collection" = "Coleção VGMRips";
"SNESmusic collection" = "Coleção SNESmusic";
"SMS Power! collection" = "Coleção SMS Power!";
"ZXArt collection" = "Coleção ZXArt";

/* Collection Descriptions */
"%d entries" = "%d entradas";
"Thousands of entries" = "Milhares de entradas";
"4K+ packs / 70K+ songs" = "4K+ pacotes / 70K+ músicas";
"1500+ sets / Super Nintendo/Famicom" = "1500+ conjuntos / Super Nintendo/Famicom";
"Master System & Game gear sets" = "Conjuntos Master System e Game gear";
"ZX Spectrum" = "ZX Spectrum";

/* Internet */
"Modizer World Charts" = "Paradas Mundiais Modizer";
"Web browser" = "Navegador web";
"No internet connectivity or website down." = "Sem conexão com internet ou site fora do ar.";

// ================================
// MARK: - SETTINGS - FAMILIES & UI
// ================================

/* Settings Families */
"Global" = "Global";
"Default Players" = "Reprodutores Padrão";
"Visualizers" = "Visualizadores";
"PR & NS colors settings" = "Configurações de cores PR e NS";
"Plugins" = "Plugins";

/* Player Selection */
"MOD player" = "Reprodutor MOD";
"SAP player" = "Reprodutor SAP";
"SID player" = "Reprodutor SID";
"VGM player" = "Reprodutor VGM";
"YM player" = "Reprodutor YM";
"NSF player" = "Reprodutor NSF";
"PT3 player" = "Reprodutor PT3";
"GBS player" = "Reprodutor GBS";
"KSS player" = "Reprodutor KSS";
"2SF player" = "Reprodutor 2SF";
"MIDI player" = "Reprodutor MIDI";

/* Global Player Settings - Additional Descriptions */
"Only for plugins supporting this feature (GME, NSFPLAY, LIBVGM)" = "Apenas para plugins que suportam este recurso (GME, NSFPLAY, LIBVGM)";
"0=auto, delay rounded to a multiple of audio buffer size" = "0=auto, atraso arredondado para múltiplo do tamanho do buffer de áudio";
"Limited: not for subsong" = "Limitado: não para subfaixas";
"Default value is 3s" = "Valor padrão é 3s";
"Default action when selecting an archive or a multisong file" = "Ação padrão ao selecionar arquivo ou arquivo multi-faixas";
"Play only selected entry or full archive/multisong file" = "Reproduzir apenas entrada selecionada ou arquivo/multi-faixas completo";
"Show Welcome screen" = "Mostrar tela de boas-vindas";
"Adplug priority for module" = "Prioridade Adplug para módulo";

/* FTP Settings */
"Server status" = "Status do servidor";
"FTP Server" = "Servidor FTP";
"Authorize anonymous" = "Autorizar anônimo";
"User" = "Usuário";
"Password" = "Senha";
"Port" = "Porta";

/* Online Settings */
"MODLAND URL" = "URL MODLAND";
"HVSC URL" = "URL HVSC";
"ASMA URL" = "URL ASMA";
"MODLAND Server" = "Servidor MODLAND";
"MODLAND cust.URL" = "URL person. MODLAND";
"HVSC Server" = "Servidor HVSC";
"HVSC cust.URL" = "URL person. HVSC";
"ASMA Server" = "Servidor ASMA";
"ASMA cust.URL" = "URL person. ASMA";


// ================================
// MARK: - SETTINGS - ADDITIONAL PLUGIN SETTINGS
// ================================

/* Visualization - MOD Pattern */
"Patterns BG Alpha" = "Alfa de Fundo de Padrões";
"Opacity of mod patterns view" = "Opacidade da visualização de padrões mod";
"MOD Color Theme" = "Tema de Cores MOD";
"MOD Current Line" = "Linha Atual MOD";
"MOD Volume bars" = "Barras de volume MOD";
"MOD Pattern Font" = "Fonte de Padrão MOD";
"MOD Pattern Font Size" = "Tamanho da Fonte de Padrão MOD";

/* Visualization - Piano Roll / MIDI */
"Piano Roll FX" = "FX Piano Roll";
"PR/Spark FX" = "FX PR/Faísca";
"Display voices label" = "Exibir rótulo de vozes";
"Notes scroller FX" = "FX rolagem de notas";
"NS/bars mode" = "Modo NS/barras";
"NS/bars style" = "Estilo NS/barras";
"Vibrato display" = "Exibição de vibrato";
"Piano FX" = "FX Piano";
"Piano bars mode" = "Modo barras piano";

/* Visualization - Spectrum */
"3D Sp.Bloom" = "Bloom Esp.3D";
"3D Land. Bloom" = "Bloom Pais.3D";
"0: off" = "0: deslig.";

/* ProjectM Settings */
"ProjectM FX" = "FX ProjectM";
"Rendering quality: Max is pixel resolution, 1/2 is half, ..." = "Qualidade de renderização: Máx. é resolução pixel, 1/2 é metade, ...";
"Custom presets/textures should be copied in .projectm folder" = "Presets/texturas personalizados devem ser copiados para pasta .projectm";
"Display preset name" = "Exibir nome do preset";
"Lim: display and disappear quickly" = "Lim: exibir e desaparecer rapidamente";
"Auto switch presets" = "Trocar presets automaticamente";
"Allow loading of milk file with script issues" = "Permitir carregamento de arquivo milk com problemas de script";
"Default is 15s" = "Padrão é 15s";
"Default is 2.7s" = "Padrão é 2.7s";
"Default value is 32" = "Valor padrão é 32";
"Default value is 24" = "Valor padrão é 24";
"Default value is 20" = "Valor padrão é 20";
"Hardcut" = "Hardcut";
"Hardcut triggers presets switch synchronized with beats." = "Hardcut aciona troca de presets sincronizada com batidas.";
"Hardcut min time" = "Tempo mín. hardcut";
"Preserve aspect ratio for compatible shaders." = "Preservar proporção de tela para shaders compatíveis.";
"Default value is 1" = "Valor padrão é 1";
"Hardcut sensitivity" = "Sensibilidade hardcut";

/* Oscilloscope Settings */
"Oscillo FX" = "FX Osciloscópio";
"Oscillo show labels" = "Osciloscópio mostrar rótulos";
"Oscillo labels font size" = "Tamanho fonte rótulos osciloscópio";
"Oscillo show grid" = "Osciloscópio mostrar grade";
"Oscillo line width" = "Largura linha osciloscópio";
"Reset all custom colors" = "Redefinir todas as cores personalizadas";
"Multi color | System 1" = "Multi-cor | Sistema 1";
"Multi color | System 2" = "Multi-cor | Sistema 2";
"Multi color | System 3" = "Multi-cor | Sistema 3";
"Multi color | System 4" = "Multi-cor | Sistema 4";
"Multi color | System 5" = "Multi-cor | Sistema 5";
"Multi color | System 6" = "Multi-cor | Sistema 6";
"Multi color | System 7" = "Multi-cor | Sistema 7";
"Multi color | System 8" = "Multi-cor | Sistema 8";

/* Piano/MIDI Colors */
"Custom color 01" = "Cor personalizada 01";
"Custom color 02" = "Cor personalizada 02";
"Custom color 03" = "Cor personalizada 03";
"Custom color 04" = "Cor personalizada 04";
"Custom color 05" = "Cor personalizada 05";
"Custom color 06" = "Cor personalizada 06";
"Custom color 07" = "Cor personalizada 07";
"Custom color 08" = "Cor personalizada 08";
"Custom color 09" = "Cor personalizada 09";
"Custom color 10" = "Cor personalizada 10";
"Custom color 11" = "Cor personalizada 11";
"Custom color 12" = "Cor personalizada 12";
"Custom color 13" = "Cor personalizada 13";
"Custom color 14" = "Cor personalizada 14";
"Custom color 15" = "Cor personalizada 15";
"Custom color 16" = "Cor personalizada 16";
"Custom color 17" = "Cor personalizada 17";
"Custom color 18" = "Cor personalizada 18";
"Custom color 19" = "Cor personalizada 19";
"Custom color 20" = "Cor personalizada 20";
"Custom color 21" = "Cor personalizada 21";
"Custom color 22" = "Cor personalizada 22";
"Custom color 23" = "Cor personalizada 23";
"Custom color 24" = "Cor personalizada 24";
"Custom color 25" = "Cor personalizada 25";
"Custom color 26" = "Cor personalizada 26";
"Custom color 27" = "Cor personalizada 27";
"Custom color 28" = "Cor personalizada 28";
"Custom color 29" = "Cor personalizada 29";
"Custom color 30" = "Cor personalizada 30";
"Custom color 31" = "Cor personalizada 31";
"Custom color 32" = "Cor personalizada 32";

/* Plugin Settings - Libopenmpt */
"Libopenmpt" = "Libopenmpt";

/* Plugin Settings - GME */
"GME" = "GME";
"Will skip song if nothing is played for specified duration (0=off)" = "Pulará música se nada for tocado pela duração especificada (0=deslig.)";

/* Plugin Settings - GSF */
"GSF" = "GSF";

/* Plugin Settings - NSFPLAY */
"NSFPLAY" = "NSFPLAY";
"Default length" = "Duração padrão";
"Oversampling. Min=0, default: 10" = "Sobreamostragem. Mín=0, padrão: 10";
"Min=off, default: 112" = "Mín=deslig., padrão: 112";
"Max=off, default: 164" = "Máx=deslig., padrão: 164";
"1/2/3=NTSC/PAL/DENDY\n4/5/6=force NTSC/PAL/DENDY" = "1/2/3=NTSC/PAL/DENDY\n4/5/6=forçar NTSC/PAL/DENDY";
"Forces IRQ capability for all NSFs, not just NSF2" = "Força capacidade IRQ para todos NSFs, não apenas NSF2";
"APU unmute on reset" = "APU desmutar ao reiniciar";
"APU phase reset" = "Redefinir fase APU";
"APU non linear mixing" = "Mixagem não linear APU";
"APU swap duty 1/2" = "APU trocar duty 1/2";
"APU Initialize sweep unmute" = "APU inicializar varredura desmutar";
"DMC enable $4011 writes" = "DMC ativar gravações $4011";
"DMC enable periodic noise" = "DMC ativar ruído periódico";
"DMC unmute on reset" = "DMC desmutar ao reiniciar";
"DMC anti clicking" = "DMC anti-clique";
"DMC non linear mixer" = "Mixer não linear DMC";
"DMC randomize noise on reset" = "DMC aleatorizar ruído ao reiniciar";
"DMC mute triangle on pitch 0" = "DMC silenciar triângulo em pitch 0";
"prevents high frequency aliasing" = "previne aliasing de alta frequência";
"DMC rand. triangle" = "DMC triângulo aleat.";
"randomize triangle on reset" = "aleatorizar triângulo ao reiniciar";
"DMC reverse bits" = "DMC bits reversos";
"reverse bits of DPCM sample bytes" = "reverter bits de bytes de amostra DPCM";
"MMC5 non linear mixing" = "Mixagem não linear MMC5";
"MMC5 Phase reset" = "Redefinir fase MMC5";
"Reset phase counter after write $5003 and $5007" = "Redefinir contador de fase após gravação $5003 e $5007";
"FDS LP filter in Hz" = "Filtro LP FDS em Hz";
"Cutoff frequency (0Hz=off, 2000Hz=default)" = "Frequência de corte (0Hz=deslig., 2000Hz=padrão)";
"FDS reset \"phase\"" = "FDS redefinir \"fase\"";
"$4085 \"resets\" modular phase" = "$4085 \"redefine\" fase modular";
"FDS write protect" = "Proteção de gravação FDS";
"write protect $8000-DFFF" = "proteção de gravação $8000-DFFF";
"VRC7 Replace with OPLL" = "VRC7 Substituir por OPLL";
"N163 Serial Multiplex mixing" = "Mixagem Serial Multiplex N163";
"N163 Write Protect Phase" = "Fase de Proteção de Gravação N163";
"N163 Limit Wavelength" = "Limite de Comprimento de Onda N163";

/* Plugin Settings - ADPLUG */
"ADPLUG" = "ADPLUG";

/* Plugin Settings - HC (Highly Complete) */
"HC" = "HC";
"Only for HC plugin" = "Apenas para plugin HC";

/* Plugin Settings - SID */
"SID" = "SID";
"Digiboost" = "Digiboost";

/* Plugin Settings - TIMIDITY */
"TIMIDITY" = "TIMIDITY";

/* Plugin Settings - UADE */
"UADE" = "UADE";
"Panning value" = "Valor de panorama";
"Gain value" = "Valor de ganho";

/* Plugin Settings - VGMPlay */
"VGMPLAY" = "VGMPLAY";

/* Plugin Settings - VGMStream */
"VGMSTREAM" = "VGMSTREAM";

/* Plugin Settings - XMP */
"XMP" = "XMP";

/* Plugin Settings - SEXYPSF */
"SEXYPSF" = "SEXYPSF";

/* Plugin Settings - GBSPlay */
"GBS" = "GBS";

/* Plugin Settings - STSOUND */
"STSOUND" = "STSOUND";

/* Plugin Settings - SC68 */
"SC68" = "SC68";

/* Additional Settings */
"Disable" = "Desativar";
"Enter playlist name" = "Digite nome da playlist";
"Ask" = "Perguntar";
"Play All" = "Reproduzir Tudo";
"Single" = "Individual";
"Archive" = "Arquivo";
"On" = "Lig.";
"Off" = "Deslig.";
"Lim" = "Lim";

// ================================
// MARK: - PLAYLISTS - ADDITIONAL ENTRIES
// ================================

/* Playlist Menu Entries */
"Add a playlist" = "Adicionar playlist";
"Create a new playlist" = "Criar nova playlist";
"Now playing" = "Tocando agora";
"1 entry" = "1 entrada";
"No entry" = "Nenhuma entrada";
"Random picks" = "Escolhas aleatórias";
"Generate a randomized playlist" = "Gerar playlist aleatória";
"Most played" = "Mais tocadas";
"Favorites" = "Favoritos";

/* Playlist Actions */
"Add/Remove files..." = "Adicionar/Remover arquivos...";
"More actions..." = "Mais ações...";
"Save as a new playlist" = "Salvar como nova playlist";

// ================================
// MARK: - WELCOME PAGES
// ================================

"Welcome to Modizer!\n" = "Bem-vindo ao Modizer!\n";
"Level up your library." = "Evolua sua biblioteca.";
"Sound meets visuals." = "Som encontra visuais.";
"Made with passion,\noffered for free." = "Feito com paixão – grátis.";

/* Welcome Page Messages */
"Your gateway to retro and tracker music.\nPower up your device with legendary game tunes, iconic tracker modules, and timeless chiptune classics." = "Seu portal para música retrô e tracker.\nTurbine seu dispositivo com trilhas lendárias de games, módulos tracker icônicos e clássicos chiptune atemporais.";

"Browse and stream from online catalogs, to complete your own collections.\nBuild, edit, and listen to playlists effortlessly." = "Navegue e transmita de catálogos online para completar suas próprias coleções.\nConstrua, edite e ouça playlists sem esforço.";

"Unlock classic oscilloscope looks, spectrum bars, piano rolls, trackers view and ProjectM/Milkdrop FX. Let Modizer paint each track with motion and color." = "Desbloqueie visual clássico de osciloscópio, barras de spectrum, piano rolls, visualização de tracker e FX ProjectM/Milkdrop. Deixe o Modizer pintar cada faixa com movimento e cor.";

"If you enjoy the app, tips are a great way to support its ongoing development.\nThank you for helping keep Modizer alive and evolving." = "Se você gosta do app, gorjetas são uma ótima forma de apoiar seu desenvolvimento contínuo.\nObrigado por ajudar a manter o Modizer vivo e evoluindo.";

"Skip" = "Pular";

// ================================
// MARK: - TIPS / DONATIONS
// ================================

/* Tips Screen */
"Support with a Tip" = "Apoiar com uma Gorjeta";
"Enjoy Modizer ?" = "Curtindo o Modizer?";
"Your support helps keep Modizer running and ad-free!" = "Seu apoio ajuda a manter o Modizer rodando e sem anúncios!";
"Already tipped so far" = "Já contribuído até agora";
"Thank you for your support! ❤️" = "Obrigado pelo seu apoio! ❤️";

/* Tip Tiers */
"Coffee" = "Café";
"Coffee & Croissant" = "Café e Croissant";
"Dinner" = "Jantar";
"Loading..." = "Carregando...";

/* Tip Actions */
"Confirm Tip" = "Confirmar Gorjeta";
"Send Tip" = "Enviar Gorjeta";
"Send a %@ tip for %@?" = "Enviar gorjeta de %@ por %@?";
"Tip" = "Gorjeta";

/* Tip Errors */
"Unable to load products. Please check your internet connection." = "Não foi possível carregar produtos. Verifique sua conexão com internet.";

/* Thank You Alert */
"Thank You! ❤️" = "Obrigado! ❤️";
"Your support means everything! Thank you for helping keep Modizer running." = "Seu apoio significa tudo! Obrigado por ajudar a manter o Modizer rodando.";

// ================================
// MARK: - MAINTENANCE SCREEN
// ================================

/* Maintenance Actions */
"Clean Database" = "Limpar Banco de Dados";
"Clear 'Now Playing' queue" = "Limpar fila 'Tocando agora'";
"Recreate Samples folder" = "Recriar pasta Samples";
"Reset settings to default" = "Redefinir configurações para padrão";
"Remove current cover" = "Remover capa atual";
"Reset Ratings" = "Redefinir Avaliações";
"Reset Played Counters" = "Redefinir Contadores de Reprodução";
"Reset Database" = "Redefinir Banco de Dados";
"Clear images cache" = "Limpar cache de imagens";

/* Maintenance Messages */
"Settings reseted" = "Configurações redefinidas";
"Ratings reseted" = "Avaliações redefinidas";
"Played Counters reseted" = "Contadores de reprodução redefinidos";
"Samples folder created" = "Pasta Samples criada";
"Cache cleaned" = "Cache limpo";
"Database reseted" = "Banco de dados redefinido";
"No cover to remove" = "Nenhuma capa para remover";
"Cover removed" = "Capa removida";
"Database cleaned" = "Banco de dados limpo";

/* Maintenance Confirmations */
"Are you sure you want to clean the DB, it might take a while ?" = "Tem certeza que deseja limpar o BD, pode demorar um pouco?";
"Clean" = "Limpar";
"Cleaning DB" = "Limpando BD";
"Cancelling..." = "Cancelando...";

// ================================
// MARK: - PLAYERMENU
// ================================

"Close FX\nwindow" = "Fechar janela\nde FX";
"All FX off" = "Todos FX deslig.";
"FX\nalpha" = "Alfa\nFX";
"Show name\ntemp." = "Mostrar nome\ntemp.";
"Show name" = "Mostrar nome";
"Bundled\npresets" = "Presets\ninclusos";
"Custom\npresets" = "Presets\nperson.";
"Blend\npresets" = "Misturar\npresets";
"Clear\nall" = "Limpar\ntudo";
"Select\nall" = "Selecionar\ntudo";
"Favorites" = "Favoritos";
"Expand" = "Expandir";
"Select\nlisted" = "Selecionar\nlistados";
"Remove\nlisted" = "Remover\nlistados";
"Selected" = "Selecionado";
"Collapse" = "Recolher";
"Labels" = "Rótulos";
"Grid" = "Grade";
"Voices\nlabels" = "Rótulos\nde vozes";
"Octaves\nlabels" = "Rótulos\nde oitavas";
"Volume\nbars" = "Barras\nde volume";
"Fixed bar" = "Barra fixa";
"BG\nopacity" = "Opacidade\nde fundo";
"Bloom:\n%s" = "Bloom:\n%s";
"Thickness:\n%s" = "Espessura:\n%s";
"Font size\n%s" = "Tamanho fonte\n%s";
"Font:\n%s" = "Fonte:\n%s";
"Info HUD:\n%s" = "HUD Info:\n%s";
"Select active %s presets" = "Selecionar presets %s ativos";
"bundled" = "inclusos";
"custom" = "personalizados";
"Select\ncustom\npresets" = "Selecionar\npresets\nperson.";
"Select\nbundled\npresets" = "Selecionar\npresets\ninclusos";
"Themes:\n%s" = "Temas:\n%s";



// MARK: - Voice Commands phrases
"Play some music in Modizer" = "Reproduzir música em Modizer";
"Start random playlist in Modizer" = "Iniciar lista aleatória em Modizer";
"Play favorites in Modizer" = "Reproduzir favoritos em Modizer";
"Start favorites playlist in Modizer" = "Iniciar lista de favoritos em Modizer";
"Play most played in Modizer" = "Reproduzir mais tocadas em Modizer";
"Start most played playlist in Modizer" = "Iniciar lista mais tocadas em Modizer";
"Play a playlist in Modizer" = "Reproduzir uma lista em Modizer";
"Start a playlist in Modizer" = "Iniciar uma lista em Modizer";
"Toggle shuffle mode in Modizer" = "Alternar modo aleatório em Modizer";
"Change shuffle mode in Modizer" = "Mudar shuffle em Modizer";
"Change loop mode in Modizer" = "Mudar modo de repetição em Modizer";
"Toggle repeat in Modizer" = "Alternar repetição em Modizer";
"What's playing in Modizer" = "O que está tocando em Modizer";
"Current song in Modizer" = "Música atual em Modizer";

"Voices commands aren't supported in MacOS." = "Os comandos de voz não são compatíveis com o macOS.";

/* Error messages */
"playlist_not_found_error" = "Playlist não encontrada. Use 'Obter playlists' para ver as playlists disponíveis.";
"playlist_empty_error" = "Esta playlist não contém entradas. Adicione música primeiro.";

"%@ (name)" = "%@ (nome)";
  "%@ (packs)" = "%@ (pacotes)";
  "%@ (rating)" = "%@ (avaliação)";
  "2D Spectrum settings" = "Configurações do spectrum 2D";
  "3D landscape settings" = "Configurações da paisagem 3D";
  "3D spectrum settings" = "Configurações do spectrum 3D";
  "Auto\nscaling" = "Escala\nautomática";
  "CGSC collection" = "Coleção CGSC";
  "CoverLibraryFolder" = "Como capa da pasta atual da biblioteca";
  "Feeling lucky" = "Estou com sorte";
  "Hide MIDI & Piano FX" = "Ocultar FX MIDI e Piano";
  "Hide other note based FX if displayed (Piano, Midi)" = "Ocultar outros FX baseados em notas se exibidos (Piano, Midi)";
  "JoshW Covers" = "Capas JoshW";
  "Limit applied in Radio mode to avoid downloading too big files." = "Limite aplicado no modo Rádio para evitar baixar arquivos muito grandes.";
  "MIDI pattern settings" = "Configurações do padrão MIDI";
  "MOD Pattern settings" = "Configurações do padrão MOD";
  "Next: %@" = "Próximo: %@";
  "Next: loading..." = "Próximo: carregando...";
  "Piano 3D settings" = "Configurações do piano 3D";
  "Piano roll settings" = "Configurações do piano roll";
  "Radio download limit" = "Limite de download do Rádio";
  "Radio mode" = "Modo Rádio";
  "Try to download covers from TGDB or MobyGames." = "Tentar baixar capas do TGDB ou MobyGames.";

/* Cloud */
  "Add Cloud Source" = "Adicionar fonte na nuvem";
  "Browse iCloud, Dropbox, OneDrive..." = "Navegar iCloud, Dropbox, OneDrive...";
  "Name this source" = "Nomear esta fonte";
  "Enter a name for this cloud folder" = "Digite um nome para esta pasta na nuvem";
  "Cloud Folder" = "Pasta na nuvem";
  "Add" = "Adicionar";
  "This cloud folder was added but may not persist after the app is closed. Some cloud providers don't support persistent access." = "Esta pasta na nuvem foi
  adicionada mas pode não persistir após o fechamento do aplicativo. Alguns provedores de nuvem não suportam acesso persistente.";
  "File cannot be downloaded.\nPlease check your internet connection." = "O arquivo não pode ser baixado.\nPor favor, verifique sua conexão com a internet.";
  "Downloading from\ncloud..." = "Baixando da\nnuvem...";
  "Download timed out. Please try again later." = "O download expirou. Por favor, tente novamente mais tarde.";
  "available" = "disponível";

